In [1]:
import pandas as pd

In [2]:
df = pd.read_html('http://sos.ga.gov/elections/election_results/2008_1104/028.htm')

In [3]:
df = df[1]

In [4]:
df.shape

(26, 149)

In [5]:
df.head(5)

,0,1,2,3,4,5,6,7,8,9,...,139,140,141,142,143,144,145,146,147,148
0,"U.S. Representative, District 12 100% of preci...",NaN,NaN,NaN,"Stone (R) 84,773","Barrow (D) 164,562","Totals 249,335",NaN,NaN,NaN,...,8.0,752.0,1719.0,2471.0,WASHINGTON,10.0,10.0,2589.0,5685.0,8274.0
1,NaN,NaN,NaN,"Stone (R) 84,773","Barrow (D) 164,562","Totals 249,335",NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,34.0%,66.0%,100.0%,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,County,PR,TP,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,BALDWIN,15,15,4925,8263,13188,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [6]:
df = df[4:]

In [7]:
df.head(5)

,0,1,2,3,4,5,6,7,8,9,...,139,140,141,142,143,144,145,146,147,148
4,BALDWIN,15,15,4925,8263,13188,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,BULLOCH,18,18,10921,12013,22934,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,BURKE,17,17,3168,5997,9165,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7,CANDLER,4,4,1366,1978,3344,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8,CHATHAM,66,66,16970,49556,66526,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [8]:
df = df[df.columns[[0,3,4]]]

In [9]:
df.head(5)

         0      3      4
4  BALDWIN   4925   8263
5  BULLOCH  10921  12013
6    BURKE   3168   5997
7  CANDLER   1366   1978
8  CHATHAM  16970  49556

In [10]:
df.columns = ['county', 'John Stone', 'John Barrow']

In [11]:
df.tail(5)

        county John Stone John Barrow
21    TATTNALL       2783        3659
22      TOOMBS       4249        4989
23    TREUTLEN       1021        1688
24      WARREN        752        1719
25  WASHINGTON       2589        5685

In [12]:
df = df.melt(id_vars=['county'])

In [13]:
df.columns = ['county', 'candidate', 'votes']

In [14]:
df.head()

    county   candidate  votes
0  BALDWIN  John Stone   4925
1  BULLOCH  John Stone  10921
2    BURKE  John Stone   3168
3  CANDLER  John Stone   1366
4  CHATHAM  John Stone  16970

In [15]:
df['votes'] = df['votes'].astype(int)

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 44 entries, 0 to 43
Data columns (total 3 columns):
county       44 non-null object
candidate    44 non-null object
votes        44 non-null int64
dtypes: int64(1), object(2)
memory usage: 1.1+ KB

In [17]:
df['office'] = 'U.S. Representative'

In [18]:
df['district'] = '12'

In [19]:
df.loc[df['candidate'] == 'John Barrow', 'party'] = 'Democrat'
df.loc[df['candidate'] == 'John Stone', 'party'] = 'Republican'

In [20]:
df.groupby(['candidate', 'office', 'district', 'party'])['votes'].sum()

candidate    office               district  party
John Barrow  U.S. Representative  12        Democrat      164562
John Stone   U.S. Representative  12        Republican     84773
Name: votes, dtype: int64

In [21]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

    county               office district       party   candidate  votes
0  BALDWIN  U.S. Representative       12  Republican  John Stone   4925
1  BULLOCH  U.S. Representative       12  Republican  John Stone  10921
2    BURKE  U.S. Representative       12  Republican  John Stone   3168
3  CANDLER  U.S. Representative       12  Republican  John Stone   1366
4  CHATHAM  U.S. Representative       12  Republican  John Stone  16970

In [22]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')